InformationRegisters/НастройкиИнтеграцииЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЦентраЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЦентровЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяЗавершитьПереходВЦентрЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииЦентраЭДО/Forms/ПомощникПерехода/Ext/Form/Module.bsl
// @strict-types

#Область ОписаниеПеременных

&НаКлиенте
Перем ПаролиСертификатов; // См. КриптографияБЭДКлиент.НовыеПаролиСертификатов

&НаКлиенте
Перем ВыбранныйСертификат; // Неопределено,СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования

&НаКлиенте
Перем ПараметрыОбработчикаОжидания; // См. ИнициализироватьПараметрыОбработчикаОжидания.ПараметрыОбработчикаОжидания

&НаКлиенте
Перем КонтекстДиагностикиДляПросмотра; // См. ОбработкаНеисправностейБЭДКлиентСервер.НовыйКонтекстДиагностики

&НаКлиенте
Перем ИдентификаторыДляПроверки; // Массив из Строка

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЭДО = Параметры.ИдентификаторЭДО;
	УчетнаяЗаписьЦентраЭДО = Параметры.УчетнаяЗаписьЦентраЭДО;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
		УчетнаяЗаписьЦентраЭДО = ИнтеграцияЦентраЭДО.ЕдинственнаяУчетнаяЗаписьЦентраЭДО();
	КонецЕсли;
	
	ЗаполнитьИдентификаторыОрганизации();
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
		ОперацияПолученияИдентификаторов = ПолучитьИдентификаторыИзЦентраЭДОВФоне(
			УчетнаяЗаписьЦентраЭДО, УникальныйИдентификатор);
	КонецЕсли;
	
	ВыгружатьДокументы = Истина;
	
	ТребуетсяЗавершитьПереход = ТребуетсяЗавершитьПереход(ИдентификаторЭДО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьИдентификаторДляПерехода(ОперацияПолученияИдентификаторов);
	
	ОперацияПолученияИдентификаторов = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыгрузкаДокументовЗапущена Тогда
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("ИдентификаторЭДО", ИдентификаторЭДО);
		ПараметрыЗакрытия.Вставить("УчетнаяЗаписьЦентраЭДО", УчетнаяЗаписьЦентраЭДО);
		Закрыть(ПараметрыЗакрытия);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ОбработкаНеисправностейБЭДКлиент.ИмяСобытияИсправлениеОшибок() Тогда
		ПроверитьИдентификаторДляПерехода();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчетнаяЗаписьЦентраЭДОПриИзменении(Элемент)
	
	ИдентификаторыДляПроверки = Новый Массив;
	
	ПроверитьИдентификаторДляПерехода();
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторОрганизацииОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		УчетныеЗаписиЭДОКлиент.ОткрытьУчетнуюЗапись(ИдентификаторЭДО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторОрганизацииПриИзменении(Элемент)
	
	ТребуетсяЗавершитьПереход = ТребуетсяЗавершитьПереход(ИдентификаторЭДО);
	
	ПроверитьИдентификаторДляПерехода();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстРегистрацияАбонентаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НажатиеНаГиперссылкуДиагностики();

КонецПроцедуры

&НаКлиенте
Процедура ТекстЗагрузкаПриглашенийРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НажатиеНаГиперссылкуДиагностики();

КонецПроцедуры

&НаКлиенте
Процедура ТекстИзменениеРежимаОбменаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НажатиеНаГиперссылкуДиагностики();

КонецПроцедуры

&НаКлиенте
Процедура ТекстВыгрузкаДокументовРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НажатиеНаГиперссылкуДиагностики();

КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьЦентраЭДОСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеСозданияУчетнойЗаписиЦентраЭДО", ЭтотОбъект);
	ИнтеграцияЦентраЭДОКлиент.ПодключитьЦентрЭДО(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура НадписьОшибкаПолученияДанныхРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НажатиеНаГиперссылкуДиагностики();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьПереходВЦентрЭДО(Команда)
	
	ПерейтиВЦентрЭДО();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДанныхФормы

&НаСервере
Процедура ЗаполнитьИдентификаторыОрганизации()
	
	СписокВыбора = Элементы.ИдентификаторЭДО.СписокВыбора;
	СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		Организация = УчетныеЗаписиЭДО.ОрганизацияУчетнойЗаписи(ИдентификаторЭДО);
		СписокИдентификаторовЭДО = УчетныеЗаписиЭДО.СписокИдентификаторовУчетныхЗаписейОрганизацииСервисаЭДО(
			Организация);
	Иначе
		СписокИдентификаторовЭДО = УчетныеЗаписиЭДО.СписокИдентификаторовУчетныхЗаписейОрганизацийСервисаЭДО();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СписокИдентификаторовЭДО) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО)
		И СписокИдентификаторовЭДО.Количество() = 1 Тогда
		ИдентификаторЭДО = СписокИдентификаторовЭДО[0].Значение;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокИдентификаторовЭДО Цикл
		НовыйЭлемент = СписокВыбора.Добавить();
		НовыйЭлемент.Значение = ЭлементСписка.Значение;
		НовыйЭлемент.Представление = СтрШаблон("%1 (%2)", ЭлементСписка.Значение, ЭлементСписка.Представление)
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Результат - Неопределено
//            - См. ИнтеграцияЦентраЭДО.ПодключитьЦентрЭДО
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура ПослеСозданияУчетнойЗаписиЦентраЭДО(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьЦентраЭДО = Результат.УчетнаяЗапись;
	
КонецПроцедуры

#КонецОбласти

#Область ПереходВЦентрЭДО

&НаКлиенте
Процедура ПерейтиВЦентрЭДО()
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		Элемент = Элементы.ИдентификаторЭДО;
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,Элемент.Заголовок);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Элемент.Имя, "Объект." + Элемент.Имя, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
		Элемент = Элементы.УчетнаяЗаписьЦентраЭДО;
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,Элемент.Заголовок);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,Элемент.Имя, "Объект." + Элемент.Имя, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.СтраницаОжиданиеПерехода;
	
	Элементы.ГруппаВыгрузкаДокументов.Видимость = ВыгружатьДокументы;
	
	Состояние = НовоеСостояниеПереходаВЦентрЭДО();
	ОтобразитьСостояниеПереходаВЦентрЭДО(Состояние);
	
	Оповещение = Новый ОписаниеОповещения("ПерейтиВЦентрЭДОПослеРегистрацииСертификатов", ЭтотОбъект, Состояние);
	
	ЗарегистрироватьСертификатыВЦентреЭДО(Оповещение);
	
КонецПроцедуры

// Параметры:
//  Результат - см. НовыйРезультатРегистрацииСертификатовВЦентреЭДО
//  Состояние - см. НовоеСостояниеПереходаВЦентрЭДО
&НаКлиенте
Процедура ПерейтиВЦентрЭДОПослеРегистрацииСертификатов(Результат, Состояние) Экспорт
	
	Состояние.СертификатыЗарегистрированы = Результат.Успех;
	ОтобразитьСостояниеПереходаВЦентрЭДО(Состояние, Результат.КонтекстДиагностики);
	
	Если Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПерейтиВЦентрЭДОПослеЗагрузкиПриглашений", ЭтотОбъект, Состояние);
	
	ЗагрузитьПриглашенияВЦентреЭДО(Оповещение);
	
КонецПроцедуры

// Параметры:
//  Результат - см. НовыйРезультатЗагрузкиПриглашенийВЦентреЭДО
//  Состояние - см. НовоеСостояниеПереходаВЦентрЭДО
&НаКлиенте
Процедура ПерейтиВЦентрЭДОПослеЗагрузкиПриглашений(Результат, Состояние) Экспорт
	
	Состояние.ПриглашенияЗагружены = Результат.Успех;
	ОтобразитьСостояниеПереходаВЦентрЭДО(Состояние, Результат.КонтекстДиагностики);
	
	Если Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПерейтиВЦентрЭДОПослеИзмененияРежима", ЭтотОбъект, Состояние);
	
	ИзменитьРежимОбменаНаЦентрЭДО(Оповещение);
	
КонецПроцедуры

// Параметры:
//  Результат - см. НовыйРезультатИзмененияРежимаНаЦентрЭДО
//  Состояние - см. НовоеСостояниеПереходаВЦентрЭДО
&НаКлиенте
Процедура ПерейтиВЦентрЭДОПослеИзмененияРежима(Результат, Состояние) Экспорт
	
	Состояние.РежимОбменаИзменен = Результат.Успех;
	ОтобразитьСостояниеПереходаВЦентрЭДО(Состояние, Результат.КонтекстДиагностики);
	
	Если Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВыгружатьДокументы Тогда
		РезультатЗапускаВыгрузки = НовыйРезультатЗапускаВыгрузкиДокументов();
		ПерейтиВЦентрЭДОЗавершение(РезультатЗапускаВыгрузки, Состояние);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПерейтиВЦентрЭДОЗавершение", ЭтотОбъект, Состояние);
	ЗапуститьВыгрузкуДокументов(Оповещение);
	
КонецПроцедуры

// Параметры:
//  Результат - см. НовыйРезультатИзмененияРежимаНаЦентрЭДО
//  Состояние - см. НовоеСостояниеПереходаВЦентрЭДО
&НаКлиенте
Процедура ПерейтиВЦентрЭДОЗавершение(Результат, Состояние) Экспорт
	
	ВыгрузкаДокументовЗапущена = Результат.Успех;
	Состояние.ВыгрузкаДокументовЗапущена = ВыгрузкаДокументовЗапущена;
	ОтобразитьСостояниеПереходаВЦентрЭДО(Состояние, Результат.КонтекстДиагностики);
	
	Если Не Результат.Успех Тогда
		Возврат;
	КонецЕсли;
	
	КлючУчетнойЗаписиЭДО = УчетныеЗаписиЭДОКлиент.КлючУчетнойЗаписи(ИдентификаторЭДО);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(КлючУчетнойЗаписиЭДО);
	
КонецПроцедуры

#КонецОбласти

#Область РегистрацияСертификатов

// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
&НаКлиенте
Функция НовыйРезультатРегистрацииСертификатовВЦентреЭДО()
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("КонтекстДиагностики", ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики());
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - ОписаниеОповещения
//  * ИдентификаторЗаявки - Строка
&НаКлиенте
Функция НовыйКонтекстРегистрацииСертификатов()
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Контекст.Вставить("ИдентификаторЗаявки", "");
	Возврат Контекст;
	
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. НовыйРезультатРегистрацииСертификатовВЦентреЭДО
&НаКлиенте
Процедура ЗарегистрироватьСертификатыВЦентреЭДО(ОповещениеОЗавершении)
	
	Контекст = НовыйКонтекстРегистрацииСертификатов();
	Контекст.ОповещениеОЗавершении = ОповещениеОЗавершении;
	
	Оповещение = Новый ОписаниеОповещения("ЗарегистрироватьСертификатыВЦентреЭДОПослеПолученияСертификатов",
		ЭтотОбъект, Контекст);
	
	КриптографияБЭДКлиент.ПолучитьДоступныеСертификаты(Оповещение);
	
КонецПроцедуры

// Параметры:
//  ДоступныеСертификаты - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  Контекст - см. НовыйКонтекстРегистрацииСертификатов
&НаКлиенте
Процедура ЗарегистрироватьСертификатыВЦентреЭДОПослеПолученияСертификатов(ДоступныеСертификаты, Контекст) Экспорт
	
	РезультатПодготовки = ПодготовитьПараметрыРегистрацииСертификатов(ИдентификаторЭДО, ДоступныеСертификаты);
	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(РезультатПодготовки.КонтекстДиагностики) Тогда
		ЗарегистрироватьСертификатЧерезЦентрЭДОЗавершение(Ложь, РезультатПодготовки.КонтекстДиагностики, Контекст);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗарегистрироватьСертификатЧерезЦентрЭДОПослеОтправкиЗаявки",
		ЭтотОбъект, Контекст);
	
	УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НачатьОтправкуСертификатовДляРегистрацииВЭДО(
		Оповещение, РезультатПодготовки.ПараметрыРегистрации, ЭтотОбъект);
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ДоступныеСертификаты - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
// 
// Возвращаемое значение:
//  Структура:
//  * ПараметрыРегистрации - см. УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиентСервер.НовыеПараметрыРегистрацииСертификатовВЭДО
//  * КонтекстДиагностики  - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
&НаСервере
Функция ПодготовитьПараметрыРегистрацииСертификатов(Знач ИдентификаторЭДО, Знач ДоступныеСертификаты)
	
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыРегистрации", Новый Структура);
	Результат.Вставить("КонтекстДиагностики", ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики());
	
	СертификатыДляРегистрации = Новый Массив; // Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
	Доверенности = Новый Соответствие;
	ОтборСертификатов = Новый Массив; // Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
	
	СертификатыУчетнойЗаписи = УчетныеЗаписиЭДО.СертификатыУчетнойЗаписи(ИдентификаторЭДО);
	
	Для Каждого СертификатУчетнойЗаписи Из СертификатыУчетнойЗаписи Цикл
		Сертификат = СертификатУчетнойЗаписи.Сертификат;
		Доверенность = СертификатУчетнойЗаписи.Доверенность;
		СертификатыДляРегистрации.Добавить(Сертификат);
		Если ДоступныеСертификаты.Найти(Сертификат) <> Неопределено Тогда
			ОтборСертификатов.Добавить(Сертификат);
		КонецЕсли;
		Если ЗначениеЗаполнено(Доверенность) Тогда
			Доверенности.Вставить(Сертификат, Доверенность);
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборСертификатов.Количество() = 0 Тогда
		ВидОперации = УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиентСервер.ВидОперацииПереходВЦентрЭДО();
		КраткоеПредставление = НСтр("ru = 'Нет доступных сертификатов для подписания регистрационных данных.'");
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
			ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
			КраткоеПредставление, КраткоеПредставление);
		
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(Результат.КонтекстДиагностики, Ошибка,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ИнтеграцияЦентраЭДО);
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыУчетнойЗаписи = УчетныеЗаписиЭДО.ПараметрыУчетнойЗаписиДляОбменаЧерезОператора(ИдентификаторЭДО);
	
	ПараметрыРегистрации = УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиентСервер.НовыеПараметрыРегистрацииСертификатовВЭДО();
	ПараметрыРегистрации.УчетнаяЗаписьЦентраЭДО = УчетнаяЗаписьЦентраЭДО;
	ПараметрыРегистрации.Организация = ПараметрыУчетнойЗаписи.Организация;
	ПараметрыРегистрации.ОператорЭДО = ПараметрыУчетнойЗаписи.ОператорЭДО;
	ПараметрыРегистрации.АдресОрганизации = ПараметрыУчетнойЗаписи.АдресОрганизации;
	ПараметрыРегистрации.АдресОрганизацииЗначение = ПараметрыУчетнойЗаписи.АдресОрганизацииЗначение;
	ПараметрыРегистрации.КодНалоговогоОргана = ПараметрыУчетнойЗаписи.КодНалоговогоОргана;
	ПараметрыРегистрации.ЭлектроннаяПочта = ПараметрыУчетнойЗаписи.ЭлектроннаяПочта;
	ПараметрыРегистрации.СертификатыДляРегистрации = СертификатыДляРегистрации;
	ПараметрыРегистрации.ИдентификаторОрганизации = ИдентификаторЭДО;
	ПараметрыРегистрации.Доверенности = Доверенности;
	ПараметрыРегистрации.СертификатыДляПодписания = ОтборСертификатов;
	ПараметрыРегистрации.Назначение = ПараметрыУчетнойЗаписи.НазначениеУчетнойЗаписи;
	ПараметрыРегистрации.ПодробноеОписание = ПараметрыУчетнойЗаписи.ПодробноеОписаниеУчетнойЗаписи;
	ПараметрыРегистрации.РежимПереходаВЦентрЭДО = Истина;
	
	СостояниеОбмена = УчетныеЗаписиЭДО.СостояниеОбменаЧерезОператораЭДО(ИдентификаторЭДО);
	Если СостояниеОбмена <> Неопределено Тогда
		ПараметрыРегистрации.ДатаПолученияДокументов = СостояниеОбмена.ДатаПолученияДокументов;
	КонецЕсли;
	
	Результат.ПараметрыРегистрации = ПараметрыРегистрации;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Результат - см. УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НовыйРезультатОтправкиСертификатовДляРегистрацииВЭДО
//  Контекст - см. НовыйКонтекстРегистрацииСертификатов
&НаКлиенте
Процедура ЗарегистрироватьСертификатЧерезЦентрЭДОПослеОтправкиЗаявки(Результат, Контекст) Экспорт
	
	Если Результат.Успех Тогда
		ЗафиксироватьНачалоПереходаВЦентрЭДО(ИдентификаторЭДО, УчетнаяЗаписьЦентраЭДО);
		Контекст.ИдентификаторЗаявки = Результат.ИдентификаторЗаявки;
		ПаролиСертификатов = Результат.ПаролиСертификатов;
		ВыбранныйСертификат = Результат.ВыбранныйСертификат;
		ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		Оповещение = Новый ОписаниеОповещения("ПроверитьРезультатРегистрацииСертификатЧерезЦентрЭДО",
			ЭтотОбъект, Контекст);
		ОбщегоНазначенияБЭДКлиент.ВыполнитьОбработкуОповещенияЧерезИнтервал(
			ПараметрыОбработчикаОжидания.ТекущийИнтервал, Оповещение);
		
	ИначеЕсли Результат.СертификатыУжеЗарегистрированы Тогда
		
		ТребуетсяЗавершитьПереход = ТребуетсяЗавершитьПереход(ИдентификаторЭДО);
		
		Если Не ТребуетсяЗавершитьПереход Тогда
			ВидОперации = УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиентСервер.ВидОперацииПереходВЦентрЭДО();
			КраткоеПредставление = СтрШаблон(
				НСтр("ru = 'Учетная запись ЭДО с идентификатором %1 уже существует в центре ЭДО. Переход невозможен.'"),
				ИдентификаторЭДО);
			Ошибка = ОбработкаНеисправностейБЭДКлиент.НоваяОшибка(ВидОперации,
				ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
				КраткоеПредставление, КраткоеПредставление);
			
			Если ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
				Ошибка.СсылкаНаОбъект = УчетнаяЗаписьЦентраЭДО;
			КонецЕсли;
			
			ОбработкаНеисправностейБЭДКлиент.ДобавитьОшибку(Результат.КонтекстДиагностики, Ошибка,
				ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ИнтеграцияЦентраЭДО);
		КонецЕсли;
		
		ЗарегистрироватьСертификатЧерезЦентрЭДОЗавершение(
			ТребуетсяЗавершитьПереход, Результат.КонтекстДиагностики, Контекст);
		
	Иначе
		
		ЗарегистрироватьСертификатЧерезЦентрЭДОЗавершение(Ложь, Результат.КонтекстДиагностики, Контекст);
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  Булево
&НаСервереБезКонтекста
Функция ТребуетсяЗавершитьПереход(Знач ИдентификаторЭДО)
	
	Настройка = РегистрыСведений.НастройкиИнтеграцииЦентраЭДО.НайтиПоИдентификаторуЭДО(ИдентификаторЭДО);
	Если Настройка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Настройка.ТребуетсяЗавершитьПереходВЦентрЭДО;
	
КонецФункции

// Параметры:
//  ПараметрыОбработчикаОжидания - Структура:
//  * МинимальныйИнтервал - Число
//  * МаксимальныйИнтервал - Число
//  * ТекущийИнтервал - Число
//  * КоэффициентУвеличенияИнтервала - Число
&НаКлиенте
Процедура ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания)
	
	ОжиданиеОперацийБЭДКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	
КонецПроцедуры

// Параметры:
//  Результат - Неопределено
//  Контекст - см. НовыйКонтекстРегистрацииСертификатов
&НаКлиенте
Процедура ПроверитьРезультатРегистрацииСертификатЧерезЦентрЭДО(Результат, Контекст) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатРегистрацииСертификатаЧерезЦентрЭДО",
		ЭтотОбъект, Контекст);
	
	ИдентификаторыЗаявок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Контекст.ИдентификаторЗаявки);
	ИдентификаторыЗаявокПоУчетнымЗаписямЦентраЭДО = Новый Соответствие;
	ИдентификаторыЗаявокПоУчетнымЗаписямЦентраЭДО.Вставить(УчетнаяЗаписьЦентраЭДО, ИдентификаторыЗаявок);
	
	УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НачатьПолучениеРезультатаРегистрацииСертификатовЭДО(
		Оповещение, ИдентификаторыЗаявокПоУчетнымЗаписямЦентраЭДО, ЭтотОбъект);
	
КонецПроцедуры

// Параметры:
//  РезультатРегистрации - см. УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НовыйРезультатРегистрацииСертификатовВЭДО
//  Контекст - см. НовыйКонтекстРегистрацииСертификатов
&НаКлиенте
Процедура ОбработатьРезультатРегистрацииСертификатаЧерезЦентрЭДО(РезультатРегистрации, Контекст) Экспорт
	
	Если ЗначениеЗаполнено(РезультатРегистрации.ЗаявкиВОбработке) Тогда
		ОжиданиеОперацийБЭДКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		Оповещение = Новый ОписаниеОповещения("ПроверитьРезультатРегистрацииСертификатЧерезЦентрЭДО",
			ЭтотОбъект, Контекст);
		ОбщегоНазначенияБЭДКлиент.ВыполнитьОбработкуОповещенияЧерезИнтервал(
			ПараметрыОбработчикаОжидания.ТекущийИнтервал, Оповещение);
		Возврат;
	КонецЕсли;
	
	ИдентификаторОрганизации = РезультатРегистрации.ИдентификаторыЭДО[Контекст.ИдентификаторЗаявки];
	Успех = ЗначениеЗаполнено(ИдентификаторОрганизации);
	ЗарегистрироватьСертификатЧерезЦентрЭДОЗавершение(Успех, РезультатРегистрации.КонтекстДиагностики, Контекст);
	
КонецПроцедуры

// Параметры:
//  Успех - Булево
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
//  КонтекстРегистрации - см. НовыйКонтекстРегистрацииСертификатов
&НаКлиенте
Процедура ЗарегистрироватьСертификатЧерезЦентрЭДОЗавершение(Успех, КонтекстДиагностики, КонтекстРегистрации)
	
	Результат = НовыйРезультатРегистрацииСертификатовВЦентреЭДО();
	Результат.Успех = Успех;
	Результат.КонтекстДиагностики = КонтекстДиагностики;
	
	ВыполнитьОбработкуОповещения(КонтекстРегистрации.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
&НаСервереБезКонтекста
Процедура ЗафиксироватьНачалоПереходаВЦентрЭДО(Знач ИдентификаторЭДО, Знач УчетнаяЗаписьЦентраЭДО)
	
	УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ЗафиксироватьНачалоПереходаВЦентрЭДО(
		ИдентификаторЭДО, УчетнаяЗаписьЦентраЭДО);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаПриглашений

// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
&НаКлиенте
Функция НовыйРезультатЗагрузкиПриглашенийВЦентреЭДО()
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("КонтекстДиагностики", ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики());
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - ОписаниеОповещения
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
&НаКлиенте
Функция НовыйКонтекстЗагрузкиПриглашенийВЦентреЭДО()
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Контекст.Вставить("КонтекстДиагностики", ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики());
	Возврат Контекст;
	
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. НовыйРезультатЗагрузкиПриглашенийВЦентреЭДО
&НаКлиенте
Процедура ЗагрузитьПриглашенияВЦентреЭДО(ОповещениеОЗавершении)
	
	КонтекстЗагрузки = НовыйКонтекстЗагрузкиПриглашенийВЦентреЭДО();
	КонтекстЗагрузки.ОповещениеОЗавершении = ОповещениеОЗавершении;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьПриглашенияВЦентреЭДОПослеАвторизации",
		ЭтотОбъект, КонтекстЗагрузки);
	
	ПараметрыАвторизации = УчетныеЗаписиЭДОКлиент.НовыеПараметрыАвторизацииВСервисеЭДО();
	ПараметрыАвторизации.ИдентификаторыЭДО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторЭДО);
	Если ЗначениеЗаполнено(ПаролиСертификатов) Тогда
		ПараметрыАвторизации.ПаролиСертификатов = ПаролиСертификатов;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыбранныйСертификат) Тогда
		ПараметрыАвторизации.ВыбранныеСертификаты.Добавить(ВыбранныйСертификат);
	КонецЕсли;
	
	УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.АвторизоватьсяВСервисеЭДО(Оповещение, ПараметрыАвторизации,
		УчетнаяЗаписьЦентраЭДО);
	
КонецПроцедуры

// Параметры:
//  РезультатАвторизации - см. УчетныеЗаписиЭДОКлиент.НовыйРезультатАвторизацииВСервисеЭДО
//  КонтекстЗагрузки - см. НовыйКонтекстЗагрузкиПриглашенийВЦентреЭДО
&НаКлиенте
Процедура ЗагрузитьПриглашенияВЦентреЭДОПослеАвторизации(РезультатАвторизации, КонтекстЗагрузки) Экспорт
	
	ПаролиСертификатов = РезультатАвторизации.ПаролиСертификатов;
	КонтекстЗагрузки.КонтекстДиагностики = РезультатАвторизации.КонтекстДиагностики;
	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстЗагрузки.КонтекстДиагностики) Тогда
		ЗагрузитьПриглашенияВЦентреЭДОЗавершение(Неопределено, КонтекстЗагрузки);
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗагрузитьПриглашенияВЦентреЭДОВФоне(УчетнаяЗаписьЦентраЭДО,
		РезультатАвторизации.РасшифрованныеМаркеры, УникальныйИдентификатор);
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьПриглашенияВЦентреЭДОЗавершение", ЭтотОбъект, КонтекстЗагрузки);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  РасшифрованныеМаркеры - см. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
//  УникальныйИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
&НаСервереБезКонтекста
Функция ЗагрузитьПриглашенияВЦентреЭДОВФоне(Знач УчетнаяЗаписьЦентраЭДО, Знач РасшифрованныеМаркеры,
	Знач УникальныйИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификаторФормы);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"ПриглашенияЭДОИнтеграцияЦентраЭДО.ЗагрузитьПриглашенияВЦентреЭДО", // См. ПриглашенияЭДОИнтеграцияЦентраЭДО.ЗагрузитьПриглашенияВЦентреЭДО
		УчетнаяЗаписьЦентраЭДО, РасшифрованныеМаркеры);
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - Неопределено
//                     - см. ДлительныеОперации.ВыполнитьФункцию
//  КонтекстЗагрузки - см. НовыйКонтекстЗагрузкиПриглашенийВЦентреЭДО
&НаКлиенте
Процедура ЗагрузитьПриглашенияВЦентреЭДОЗавершение(ДлительнаяОперация, КонтекстЗагрузки) Экспорт
	
	Результат = НовыйРезультатЗагрузкиПриглашенийВЦентреЭДО();
	Результат.КонтекстДиагностики = КонтекстЗагрузки.КонтекстДиагностики;
	Если ДлительнаяОперация = Неопределено Тогда
		ВыполнитьОбработкуОповещения(КонтекстЗагрузки.ОповещениеОЗавершении, Результат);
		Возврат;
	КонецЕсли;
	
	РезультатЗагрузкиВЦентреЭДО = ОбщегоНазначенияБЭДКлиент.РезультатВыполненияФоновогоЗадания(
		НСтр("ru = 'Загрузка приглашений в центре ЭДО'"), ДлительнаяОперация, Результат.КонтекстДиагностики); // См. ПриглашенияЭДОИнтеграцияЦентраЭДО.ЗагрузитьПриглашенияВЦентреЭДО
	
	ОбработкаНеисправностейБЭДКлиентСервер.ДополнитьКонтекстДиагностики(Результат.КонтекстДиагностики,
		РезультатЗагрузкиВЦентреЭДО.КонтекстДиагностики);
	
	Если Не ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(Результат.КонтекстДиагностики) Тогда
		Результат.Успех = Истина;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(КонтекстЗагрузки.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеРежимаОбмена

// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
&НаКлиенте
Функция НовыйРезультатИзмененияРежимаНаЦентрЭДО()
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("КонтекстДиагностики", ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики());
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. ИзменитьРежимОбменаНаЦентрЭДО.ОповещениеОЗавершении
&НаКлиенте
Функция НовыйКонтекстИзмененияРежимаНаЦентрЭДО()
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Возврат Контекст;
	
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. НовыйРезультатИзмененияРежимаНаЦентрЭДО
&НаКлиенте
Процедура ИзменитьРежимОбменаНаЦентрЭДО(ОповещениеОЗавершении)
	
	Контекст = НовыйКонтекстИзмененияРежимаНаЦентрЭДО();
	Контекст.ОповещениеОЗавершении = ОповещениеОЗавершении;
	
	Оповещение = Новый ОписаниеОповещения("ИзменитьРежимОбменаНаЦентрЭДОЗавершение", ЭтотОбъект, Контекст);
	
	ОбщегоНазначенияБЭДКлиент.ВыполнитьОбработкуОповещенияЧерезИнтервал(0.1, Оповещение);
	
КонецПроцедуры

// Параметры:
//  Результат - Неопределено
//  Контекст - см. НовыйКонтекстИзмененияРежимаНаЦентрЭДО
&НаКлиенте
Процедура ИзменитьРежимОбменаНаЦентрЭДОЗавершение(Результат, Контекст) Экспорт
	
	ЗафиксироватьЗавершениеНастройкиПереходаВЦентрЭДО(ИдентификаторЭДО, УчетнаяЗаписьЦентраЭДО);
	
	Результат = НовыйРезультатИзмененияРежимаНаЦентрЭДО();
	Результат.Успех = Истина;
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
&НаСервереБезКонтекста
Процедура ЗафиксироватьЗавершениеНастройкиПереходаВЦентрЭДО(Знач ИдентификаторЭДО, Знач УчетнаяЗаписьЦентраЭДО)
	
	УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ЗафиксироватьЗавершениеНастройкиПереходаВЦентрЭДО(
		ИдентификаторЭДО, УчетнаяЗаписьЦентраЭДО)
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаДокументов

// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
&НаКлиенте
Функция НовыйРезультатЗапускаВыгрузкиДокументов()
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("КонтекстДиагностики", ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики());
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. ЗапуститьВыгрузкуДокументов.ОповещениеОЗавершении
&НаКлиенте
Функция НовыйКонтекстЗапускаВыгрузкиДокументов()
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Возврат Контекст;
	
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. НовыйРезультатИзмененияРежимаНаЦентрЭДО
&НаКлиенте
Процедура ЗапуститьВыгрузкуДокументов(ОповещениеОЗавершении)
	
	Контекст = НовыйКонтекстЗапускаВыгрузкиДокументов();
	Контекст.ОповещениеОЗавершении = ОповещениеОЗавершении;
	
	Оповещение = Новый ОписаниеОповещения("ЗапуститьВыгрузкуДокументовЗавершение", ЭтотОбъект, Контекст);
	
	ОбщегоНазначенияБЭДКлиент.ВыполнитьОбработкуОповещенияЧерезИнтервал(0.1, Оповещение);
	
КонецПроцедуры

// Параметры:
//  Результат - Неопределено
//  Контекст - см. НовыйКонтекстЗапускаВыгрузкиДокументов
&НаКлиенте
Процедура ЗапуститьВыгрузкуДокументовЗавершение(Результат, Контекст) Экспорт
	
	Состояние = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.ЗапуститьВыгрузкуВЦентрЭДО(ИдентификаторЭДО);
	
	Результат = НовыйРезультатЗапускаВыгрузкиДокументов();
	Результат.Успех = Истина;
	
	ИмяСобытия = ИнтеграцияЦентраЭДОКлиент.ИмяСобытияОповещенияОбновлениеСостоянияВыгрузкиВЦентрЭДО();
	Оповестить(ИмяСобытия, Состояние);
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОтображениеСостоянияПерехода

// Возвращаемое значение:
//  Структура:
//  * СертификатыЗарегистрированы - Неопределено,Булево
//  * ПриглашенияЗагружены - Неопределено,Булево
//  * РежимОбменаИзменен - Неопределено,Булево
//  * ВыгрузкаДокументовЗапущена - Неопределено,Булево
&НаКлиенте
Функция НовоеСостояниеПереходаВЦентрЭДО()
	
	Состояние = Новый Структура;
	Состояние.Вставить("СертификатыЗарегистрированы", Неопределено);
	Состояние.Вставить("ПриглашенияЗагружены", Неопределено);
	Состояние.Вставить("РежимОбменаИзменен", Неопределено);
	Состояние.Вставить("ВыгрузкаДокументовЗапущена", Неопределено);
	Возврат Состояние;
	
КонецФункции

// Параметры:
//  Состояние - см. НовоеСостояниеПереходаВЦентрЭДО
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
&НаКлиенте
Процедура ОтобразитьСостояниеПереходаВЦентрЭДО(Состояние, КонтекстДиагностики = Неопределено)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаРегистрацияАбонентаВыполнение", "Видимость",
		Состояние.СертификатыЗарегистрированы = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаРегистрацияАбонентаВыполнено", "Видимость",
		Состояние.СертификатыЗарегистрированы = Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаРегистрацияАбонентаОшибка", "Видимость",
		Состояние.СертификатыЗарегистрированы = Ложь);
	Если Состояние.СертификатыЗарегистрированы = Ложь Тогда
		ОбработатьОшибкиВКонтекстномРежиме(КонтекстДиагностики,
			Элементы.ТекстРегистрацияАбонентаРасширеннаяПодсказка);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаЗагрузкаПриглашенийОжидание", "Видимость",
		Состояние.СертификатыЗарегистрированы <> Истина И Состояние.ПриглашенияЗагружены = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаЗагрузкаПриглашенийВыполнение", "Видимость",
		Состояние.СертификатыЗарегистрированы = Истина И Состояние.ПриглашенияЗагружены = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаЗагрузкаПриглашенийВыполнено", "Видимость",
		Состояние.ПриглашенияЗагружены = Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаЗагрузкаПриглашенийОшибка", "Видимость",
		Состояние.ПриглашенияЗагружены = Ложь);
	Если Состояние.ПриглашенияЗагружены = Ложь Тогда
		ОбработатьОшибкиВКонтекстномРежиме(КонтекстДиагностики,
			Элементы.ТекстЗагрузкаПриглашенийРасширеннаяПодсказка);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаИзменениеРежимаОбменаОжидание", "Видимость",
		Состояние.ПриглашенияЗагружены <> Истина И Состояние.РежимОбменаИзменен = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаИзменениеРежимаОбменаВыполнение", "Видимость",
		Состояние.ПриглашенияЗагружены = Истина И Состояние.РежимОбменаИзменен = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаИзменениеРежимаОбменаВыполнено", "Видимость",
		Состояние.РежимОбменаИзменен = Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаИзменениеРежимаОбменаОшибка", "Видимость",
		Состояние.РежимОбменаИзменен = Ложь);
	Если Состояние.РежимОбменаИзменен = Ложь Тогда
		ОбработатьОшибкиВКонтекстномРежиме(КонтекстДиагностики,
			Элементы.ТекстИзменениеРежимаОбменаРасширеннаяПодсказка);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаВыгрузкаДокументовОжидание", "Видимость",
		Состояние.РежимОбменаИзменен <> Истина И Состояние.ВыгрузкаДокументовЗапущена = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаВыгрузкаДокументовВыполнение", "Видимость",
		Состояние.РежимОбменаИзменен = Истина И Состояние.ВыгрузкаДокументовЗапущена = Неопределено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаВыгрузкаДокументовВыполнено", "Видимость",
		Состояние.ВыгрузкаДокументовЗапущена = Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаВыгрузкаДокументовОшибка", "Видимость",
		Состояние.ВыгрузкаДокументовЗапущена = Ложь);
	Если Состояние.ВыгрузкаДокументовЗапущена = Ложь Тогда
		ОбработатьОшибкиВКонтекстномРежиме(КонтекстДиагностики,
			Элементы.ТекстВыгрузкаДокументовРасширеннаяПодсказка);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
//  ЭлементДляОтображенияОшибок - ДекорацияФормы
&НаКлиенте
Процедура ОбработатьОшибкиВКонтекстномРежиме(КонтекстДиагностики, ЭлементДляОтображенияОшибок)
	
	Если КонтекстДиагностики = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстДиагностикиДляПросмотра = КонтекстДиагностики;
	
	ПараметрыОбработкиОшибок = ОбработкаНеисправностейБЭДКлиент.НовыеПараметрыОбработкиОшибок();
	ПараметрыОбработкиОшибок.КонтекстныйРежимОбработки = Истина;
	ПараметрыОбработкиОшибок.НадписьПредупреждение = ЭлементДляОтображенияОшибок;
	ПараметрыОбработкиОшибок.ТекстПредупреждения = ДиагностикаЭДОКлиент.ТекстПредупреждения(КонтекстДиагностики);
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики, ПараметрыОбработкиОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеНаГиперссылкуДиагностики() 
	
	Если КонтекстДиагностикиДляПросмотра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстДиагностикиДляПросмотра.ЗаголовокОперации = НСтр("ru = 'При переходе в центр ЭДО'");
	КонтекстДиагностикиДляПросмотра.ОшибкиОбработаны = Ложь;
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностикиДляПросмотра);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаИдентификатора

// Возвращаемое значение:
//  Структура:
//  * ОжиданиеПолучения - Булево
//  * ОшибкаПолучения - Булево
//  * ОшибкаПерехода - Булево
&НаКлиенте
Функция НовоеСостояниеПроверкиИдентификатораДляПерехода()
	
	Состояние = Новый Структура;
	Состояние.Вставить("ОжиданиеПолучения", Ложь);
	Состояние.Вставить("ОшибкаПолучения", Ложь);
	Состояние.Вставить("ОшибкаПерехода", Ложь);
	Возврат Состояние;
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - Неопределено
//                     - см. ДлительныеОперации.ВыполнитьФункцию
&НаКлиенте
Процедура ПроверитьИдентификаторДляПерехода(Знач ДлительнаяОперация = Неопределено)
	
	Состояние = НовоеСостояниеПроверкиИдентификатораДляПерехода();
	
	Если ЗначениеЗаполнено(ИдентификаторыДляПроверки) Тогда
		ПроверитьИдентификаторДляПереходаЗавершение(Состояние);
		ОтобразитьСостояниеПроверкиИдентификатора(Состояние);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьЦентраЭДО) Тогда
		ОтобразитьСостояниеПроверкиИдентификатора(Состояние);
		Возврат;
	КонецЕсли;
	
	Состояние.ОжиданиеПолучения = Истина;
	
	ОтобразитьСостояниеПроверкиИдентификатора(Состояние);
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьИдентификаторДляПереходаПослеПолучения",
		ЭтотОбъект, Состояние);
	
	Если ДлительнаяОперация <> Неопределено Тогда
		КонтекстПолучения = НовыйКонтекстПолученияИдентификаторовИзЦентраЭДО();
		КонтекстПолучения.ОповещениеОЗавершении = Оповещение;
		ПолучитьИдентификаторыИзЦентраЭДОПослеЗапускаВФоне(ДлительнаяОперация, КонтекстПолучения);
	Иначе
		ПолучитьИдентификаторыИзЦентраЭДО(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - см. НовыйРезультатПолученияИдентификаторовИзЦентраЭДО
//  Состояние - см. НовоеСостояниеПроверкиИдентификатораДляПерехода
&НаКлиенте
Процедура ПроверитьИдентификаторДляПереходаПослеПолучения(Результат, Состояние) Экспорт
	
	Состояние.ОжиданиеПолучения = Ложь;
	
	ЕстьОшибки = ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(Результат.КонтекстДиагностики);
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(Результат.КонтекстДиагностики);
	Если ЕстьОшибки Тогда
		Состояние.ОшибкаПолучения = Истина;
		ИдентификаторыДляПроверки = Новый Массив;
		ОбработатьОшибкиВКонтекстномРежиме(Результат.КонтекстДиагностики,
			Элементы.НадписьОшибкаПолученияДанныхРасширеннаяПодсказка);
	Иначе
		ИдентификаторыДляПроверки = Результат.ИдентификаторыЭДО;
	КонецЕсли;
	
	ПроверитьИдентификаторДляПереходаЗавершение(Состояние);
	
	ОтобразитьСостояниеПроверкиИдентификатора(Состояние);
	
КонецПроцедуры

// Параметры:
//  Состояние - см. НовоеСостояниеПроверкиИдентификатораДляПерехода
&НаКлиенте
Процедура ПроверитьИдентификаторДляПереходаЗавершение(Состояние)
	
	Если ЗначениеЗаполнено(ИдентификаторыДляПроверки)
		И ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		Состояние.ОшибкаПерехода = ИдентификаторыДляПроверки.Найти(ИдентификаторЭДО) <> Неопределено
			И Не ТребуетсяЗавершитьПереход;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Состояние - см. НовоеСостояниеПроверкиИдентификатораДляПерехода
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
&НаКлиенте
Процедура ОтобразитьСостояниеПроверкиИдентификатора(Состояние, КонтекстДиагностики = Неопределено)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаПолучениеДанных", "Видимость", Состояние.ОжиданиеПолучения);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НадписьПолучениеДанных", "Видимость", Состояние.ОжиданиеПолучения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаОшибкаВыбора", "Видимость", Состояние.ОшибкаПерехода);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НадписьОшибкаВыбора", "Видимость", Состояние.ОшибкаПерехода);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КартинкаОшибкаПолученияДанных", "Видимость", Состояние.ОшибкаПолучения);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НадписьОшибкаПолученияДанных", "Видимость", Состояние.ОшибкаПолучения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"УчетнаяЗаписьЦентраЭДО", "Доступность", Не Состояние.ОжиданиеПолучения);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ИдентификаторЭДО", "Доступность", Не Состояние.ОжиданиеПолучения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ВыполнитьПереходВЦентрЭДО", "Доступность",
		Не Состояние.ОжиданиеПолучения И Не Состояние.ОшибкаПолучения И Не Состояние.ОшибкаПерехода);
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеИдентификаторов

// Возвращаемое значение:
//  Структура - Новый результат получения идентификаторов из центра ЭДО:
//  * ИдентификаторыЭДО - Массив из Строка
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
&НаКлиенте
Функция НовыйРезультатПолученияИдентификаторовИзЦентраЭДО()
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторыЭДО", Новый Массив);
	Результат.Вставить("КонтекстДиагностики", ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики());
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - ОписаниеОповещения - результат: см. НовыйРезультатПолученияИдентификаторовИзЦентраЭДО
&НаКлиенте
Функция НовыйКонтекстПолученияИдентификаторовИзЦентраЭДО()
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Возврат Контекст;
	
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. НовыйРезультатПолученияИдентификаторовИзЦентраЭДО
&НаКлиенте
Процедура ПолучитьИдентификаторыИзЦентраЭДО(ОповещениеОЗавершении = Неопределено)
	
	КонтекстПолучения = НовыйКонтекстПолученияИдентификаторовИзЦентраЭДО();
	
	Если ОповещениеОЗавершении <> Неопределено Тогда
		КонтекстПолучения.ОповещениеОЗавершении = ОповещениеОЗавершении;
	КонецЕсли;
	
	ДлительнаяОперация = ПолучитьИдентификаторыИзЦентраЭДОВФоне(УчетнаяЗаписьЦентраЭДО, УникальныйИдентификатор);
	
	ПолучитьИдентификаторыИзЦентраЭДОПослеЗапускаВФоне(ДлительнаяОперация, КонтекстПолучения);
	
КонецПроцедуры

// Параметры:
//  ДлительнаяОперация - см. ДлительныеОперации.ВыполнитьФункцию
//  КонтекстПолучения - см. НовыйКонтекстПолученияИдентификаторовИзЦентраЭДО
&НаКлиенте
Процедура ПолучитьИдентификаторыИзЦентраЭДОПослеЗапускаВФоне(ДлительнаяОперация, КонтекстПолучения)
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьИдентификаторыИзЦентраЭДОЗавершение",
		ЭтотОбъект, КонтекстПолучения);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  УникальныйИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
&НаСервереБезКонтекста
Функция ПолучитьИдентификаторыИзЦентраЭДОВФоне(Знач УчетнаяЗаписьЦентраЭДО, Знач УникальныйИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификаторФормы);
	ПараметрыВыполнения.ОжидатьЗавершения = 0;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ПолучитьВсеИдентификаторыУчетныхЗаписейЭДО", // См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ПолучитьВсеИдентификаторыУчетныхЗаписейЭДО
		УчетнаяЗаписьЦентраЭДО);
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - см. ДлительныеОперации.ВыполнитьФункцию
//  КонтекстПолучения - см. НовыйКонтекстПолученияИдентификаторовИзЦентраЭДО
&НаКлиенте
Процедура ПолучитьИдентификаторыИзЦентраЭДОЗавершение(ДлительнаяОперация, КонтекстПолучения) Экспорт
	
	Результат = НовыйРезультатПолученияИдентификаторовИзЦентраЭДО();
	
	РезультатПолучения = ОбщегоНазначенияБЭДКлиент.РезультатВыполненияФоновогоЗадания(
		НСтр("ru = 'Получение данных об идентификаторах в центре ЭДО'"), ДлительнаяОперация, Результат.КонтекстДиагностики); // См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ПолучитьВсеИдентификаторыУчетныхЗаписейЭДО
	
	Если ЗначениеЗаполнено(РезультатПолучения) Тогда
		Результат.ИдентификаторыЭДО = РезультатПолучения.ИдентификаторыЭДО;
		Результат.КонтекстДиагностики = РезультатПолучения.КонтекстДиагностики;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(КонтекстПолучения.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
